{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "d72043c0",
   "metadata": {},
   "source": [
    "# 10. Скучная лекция"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "ad6af6b2",
   "metadata": {},
   "source": [
    "Лёша сидел на лекции. Ему было невероятно скучно. Голос лектора казался таким далеким и незаметным...\n",
    "\n",
    "Чтобы окончательно не уснуть, он взял листок и написал на нём свое любимое слово. Чуть ниже он повторил своё любимое слово, без первой буквы. Ещё ниже он снова написал своё любимое слово, но в этот раз без двух первых и последней буквы.\n",
    "\n",
    "Тут ему пришла в голову мысль — времени до конца лекции все равно ещё очень много, почему бы не продолжить выписывать всеми возможными способами это слово без какой-то части с начала и какой-то части с конца?\n",
    "\n",
    "После лекции Лёша рассказал Максу, как замечательно он скоротал время. Максу стало интересно посчитать, сколько букв каждого вида встречается у Лёши в листочке. Но к сожалению, сам листочек куда-то запропастился.\n",
    "\n",
    "Макс хорошо знает любимое слово Лёши, а ещё у него не так много свободного времени, как у его друга, так что помогите ему быстро восстановить, сколько раз Лёше пришлось выписать каждую букву. "
   ]
  },
  {
   "cell_type": "markdown",
   "id": "837093d1",
   "metadata": {},
   "source": [
    "# Формат ввода:\n",
    "\n",
    "\n",
    "\n",
    "На вход подаётся строка, состоящая из строчных латинских букв — любимое слово Лёши.\n",
    "\n",
    "Длина строки лежит в пределах от 5 до 100 000 символов.\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "e2a12638",
   "metadata": {},
   "source": [
    "# Формат вывода:\n",
    "\n",
    "Для каждой буквы на листочке Лёши, выведите её, а затем через двоеточие и пробел сколько раз она встретилась в выписанных Лёшей словах (см. формат вывода в примерах). Буквы должны следовать в алфавитном порядке. Буквы, не встречающиеся на листочке, выводить не нужно. "
   ]
  },
  {
   "cell_type": "markdown",
   "id": "38b9f2d2",
   "metadata": {},
   "source": [
    "# Пример:\n",
    "\n",
    "Ввод:\n",
    "\n",
    "    hello\n",
    "    \n",
    "Вывод:\n",
    "\n",
    "    e: 8\n",
    "    h: 5\n",
    "    l: 17\n",
    "    o: 5"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "908c0ae6",
   "metadata": {},
   "source": [
    "# Решение:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "bfc6ee62",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "hello\n",
      "e: 8\n",
      "h: 5\n",
      "l: 17\n",
      "o: 5\n"
     ]
    }
   ],
   "source": [
    "word = input()\n",
    "n = len(word)\n",
    "voc = {}\n",
    "a = []\n",
    "for i in range(n):\n",
    "    k = (n - i) * (i + 1)\n",
    "    voc[word[i]] = voc.get(word[i], 0) + k\n",
    "nam = voc.keys()\n",
    "for i in sorted(nam):\n",
    "    print(i, \": \", voc[i], sep='')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "fed99da8",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
